export const semesterTimeTable = [
  {
    "title": "천안 등교/하교",
    "timetable": [
      ["구간", "천안역", "터미널", "두정역", "고속철", "신방동"],
      ["한기대", "", "", "", "", "등교만"],
      ["두정역", "", "", "07:43", "", ""],
      ["주공11단지APT", "", "", "", "07:40", ""],
      ["동일하이빌APT", "", "", "", "07:41", ""],
      ["노동부(천안지방사무소)", "", "", "07:45", "", ""],
      ["늘푸른APT", "", "", "07:46", "", ""],
      ["성정지하도(6단지)", "", "", "07:48", "", ""],
      ["전자랜드", "", "", "07:49", "", ""],
      ["광혜당약국", "", "", "07:50", "", ""],
      ["신방동(현대APT)", "", "", "", "", "07:55"],
      ["신방동 새마을금고", "", "", "", "", "07:56"],
      ["천안아산KTX(3번출구)", "", "", "", "07:46", ""],
      ["Y-City", "", "", "", "07:47", ""],
      ["터미널(신세계)", "", "08:00", "", "", ""],
      ["천안역(학화호두과자)", "08:05", "", "", "", ""],
      ["한화꿈에그린APT", "", "", "", "07:49", ""],
      ["용암마을", "", "", "", "07:50", ""],
      ["충무병원", "", "", "07:53", "", "08:01"],
      ["주공7단지APT", "", "", "", "07:51", ""],
      ["세종아트빌라BS(구 일봉회관)", "", "", "07:55", "", "08:03"],
      ["성황동 신협", "", "08:03", "", "", ""],
      ["신방동 리차드", "", "", "", "07:53", ""],
      ["신방동 GS주유소", "", "", "", "07:54", ""],
      ["제일고 맞은편(구 교육청)", "", "08:06", "", "", "08:08"],
      ["남부오거리(귀뚜라미보일러)", "08:07", "", "07:56", "", ""],
      ["원성동(GS마트)", "", "08:08", "", "", "08:10"],
      ["삼룡교(유니클로,구 한방병원)", "08:10", "08:09", "07:58", "", "08:12"],
      ["청당동(벽산블루밍)", "", "", "", "08:00", ""],
      ["부영(APT)", "", "", "", "08:05", ""],
      ["구성동(GS주유소)", "08:11", "08:10", "08:00", "", "08:13"],
      ["청수고BS 앞쪽", "", "", "", "", "08:14"],
      ["한양수자인APT(청당동)", "", "", "", "", "08:15"],
      ["동우APT,신계초,운전리,연춘리", "", "", "O", "O", ""],
      ["중앙APT", "O", "O", "O", "O", "O"],
      ["한기대", "08:50", "08:50", "08:50", "08:50", "08:50"]
    ]
  },
  {
    "title": "천안 셔틀",
    "timetable": [
      ["구간", "1회", "2회", "3회", "금요일추가", "4회", "5회", "6회", "7회", "8회", "9회", "10회", "11회", "12회", "토요일 오후", "토요일 오후", "일요일 오후", "일요일 야간(2대)"],
      ["한기대", "09:10", "11:00", "14:00", "14:30", "15:00", "16:00", "16:30", "17:00", "", "19:30", "21:00", "", "22:40", "14:00", "", "17:00", ""],
      ["천안역(태극당 건너 정류장)", "09:30", "", "", "", "15:20", "", "", "", "", "", "", "", "", "", "", "", ""],
      ["터미널(신세계)", "09:40", "", "", "", "15:30", "", "", "", "", "", "", "", "", "", "", "", ""],
      ["두정캠퍼스", "09:55", "", "", "", "15:45", "", "", "", "", "", "21:50", "", "", "", "", "", ""],
      ["터미널(신세계)", "10:10", "11:25", "14:25", "14:55", "16:05", "16:25", "16:55", "17:25", "18:45", "19:55", "하차", "22:00", "23:00", "14:25", "18:45", "17:25", "21:15 / 21:30"],
      ["천안역", "10:15", "11:30", "14:30", "15:00", "16:10", "16:30", "17:00", "17:30", "18:50", "20:00", "종점", "22:05", "23:05", "14:30", "18:50", "17:30", "21:20 / 21:35"],
      ["한기대", "11:00", "12:00", "15:00", "15:30", "16:40", "17:00", "17:30", "18:00", "19:20", "20:40", "", "22:25", "", "15:00", "19:30", "18:10", "21:50 / 22:00"],
    ]
  },
  {
    "title": "청주 등교/하교",
    "timetable": [
      ["구간", "체육관", "용암동", "산남동", "분평동"],
      ["한기대", "", "", "", "등교만"],
      ["산남동 수곡교회", "", "", "07:20", ""],
      ["분평동 전자랜드", "", "", "", "07:30"],
      ["남성초등학교", "", "", "", "07:31"],
      ["충북 원예농협(GS마트)", "", "", "07:22", ""],
      ["청주교대(KFC앞)", "", "", "", "07:32"],
      ["청주농협 남부지점(일신장)", "", "", "", "07:34"],
      ["충북대병원(버스정류장)", "", "", "07:26", ""],
      ["서원대학교", "", "", "", "07:38"],
      ["KBS맞은편", "", "", "07:27", ""],
      ["용암동(현대APT)", "", "07:30", "", ""],
      ["개신동푸르지오(버스정류장)", "", "", "07:31", ""],
      ["사직동 새마을금고(거구장)", "", "", "", "07:41"],
      ["군산회타운(경신초 맞은편)", "", "", "07:32", ""],
      ["GS 대청주유소(용암동)", "", "07:31", "", ""],
      ["석교동육거리", "", "07:33", "", ""],
      ["사직평화APT(버스정류장)", "", "", "", "07:42"],
      ["청원경찰서", "", "", "", "07:43"],
      ["루체피에스타(구 대한예식장)", "", "", "", "07:45"],
      ["체육관(NEPA)", "07:40", "", "", ""],
      ["사창사거리", "07:42", "", "", ""],
      ["갤러리호텔", "07:46", "", "", ""],
      ["솔밭공원", "07:50", "", "", ""],
      ["상당공원(상공회의소)", "", "07:36", "", ""],
      ["청주시청(방아다리)", "", "07:37", "", ""],
      ["롯데마트 앞", "", "", "07:37", ""],
      ["청주농고후문", "", "", "", "07:47"],
      ["문화산업단지(구 제조창)", "", "07:40", "", ""],
      ["성모병원(율량 맥도날드)", "", "07:45", "", "07:50"],
      ["흥덕고교 버스정류장", "", "", "07:42", ""],
      ["청주역(서촌동버스정류장)", "07:56", "", "07:46", ""],
      ["옥산(가락3리버스정류장)", "", "", "07:49", ""],
      ["과학단지(오창프라자)", "", "08:00", "", "08:00"],
      ["한기대", "08:50", "08:50", "08:50", "08:50"],
    ]
  },
  {
    "title": "청주 셔틀",
    "timetable": [
      ["구간", "1회", "2회", "3회", "4회", "5회"],
      ["한기대", "", "14:00", "16:00", "20:00", "22:00"],
      ["옥산(가락3리)", "", "하차", "", "하차", ""],
      ["청주역", "", "하차", "", "하차", ""],
      ["G-WELL CITY", "", "하차", "", "하차", ""],
      ["솔밭공원", "", "하차", "", "하차", ""],
      ["봉명우체국", "", "하차", "", "하차", ""],
      ["오창과학단지", "", "", "하차", "", "하차"],
      ["성모병원", "", "", "하차", "", "하차"],
      ["신봉사거리(LPG충전소)", "", "", "하차", "", "하차"],
      ["봉명사거리", "", "", "하차", "", "하차"],
      ["사창사거리", "", "하차", "하차", "하차", "하차"],
      ["체육관", "", "하차", "하차", "하차", "종점"],
      ["상당공원", "", "하차", "하차", "하차", ""],
      ["육거리", "", "하차", "하차", "하차", ""],
      ["삼양가스", "", "하차", "하차", "하차", ""],
      ["용암동(현대APT)", "11:50", "종점", "종점", "종점", ""],
      ["GS 대청주유소(용암동)", "11:51", "", "", "", ""],
      ["석교동육거리", "11:54", "", "", "", ""],
      ["상당공원(지하상가)", "11:56", "", "", "", ""],
      ["체육관(NEFA)", "11:58", "", "", "", ""],
      ["사창사거리", "12:00", "", "", "", ""],
      ["갤러리호텔", "12:02", "", "", "", ""],
      ["솔밭공원앞", "12:05", "", "", "", ""],
      ["청주역(서촌동버스정류장)", "12:10", "", "", "", ""],
      ["옥산(가락3리버스정류장)", "12:12", "", "", "", ""],
      ["한기대", "12:50", "", "", "", ""]
    ]
  },
  {
    "title": "서울 등교/하교",
    "timetable": [
      ["서울", "학기중 월~금"],
      ["교대 > 한기대", "07:20"],
      ["한기대 > 교대", "18:10 (월,금2 2회: 16:30, 18:10)"]
    ]
  },
  {
    "title": "대전 등교/하교",
    "timetable": [
      ["대전", "주 5일중 금요일 하교, 일요일 등교"],
      ["한기대 > 대전 (하교/주말전날)", "18:20"],
      ["대전 > 한기대 (등교/주초 휴무일 전날)", "18:10(시청), 18:20(역)"]
    ]
  },
  {
    depart: "한기대",
    arrival: "야우리",
    timetable: [
      {
        time: 9,
        minute: 10
      },
      {
        time: 11,
        minute: 0
      },
      {
        time: 14,
        minute: 0
      },
      {
        time: 15,
        minute: 0
      },
      {
        time: 16,
        minute: 0
      },
      {
        time: 16,
        minute: 30
      },
      {
        time: 17,
        minute: 0
      },
      {
        time: 19,
        minute: 30
      },
      {
        time: 21,
        minute: 0
      },
      {
        time: 22,
        minute: 40
      }
    ]
  },
  {
    depart: "야우리",
    arrival: "한기대",
    timetable: [
      {
        time: 10,
        minute: 10
      },
      {
        time: 11,
        minute: 25
      },
      {
        time: 14,
        minute: 25
      },
      {
        time: 16,
        minute: 5
      },
      {
        time: 16,
        minute: 25
      },
      {
        time: 16,
        minute: 55
      },
      {
        time: 17,
        minute: 25
      },
      {
        time: 19,
        minute: 55
      },
      {
        time: 22,
        minute: 0
      },
      {
        time: 23,
        minute: 0
      },
    ]
  },
  {
    depart: "한기대",
    arrival: "천안역",
    timetable: [
      {
        time: 9,
        minute: 10
      },
      {
        time: 15,
        minute: 0
      }
    ]
  },
  {
    depart: "천안역",
    arrival: "한기대",
    timetable: [
      {
        time: 10,
        minute: 15
      },
      {
        time: 11,
        minute: 30
      },
      {
        time: 14,
        minute: 30
      },
      {
        time: 16,
        minute: 10
      },
      {
        time: 16,
        minute: 30
      },
      {
        time: 17,
        minute: 0
      },
      {
        time: 17,
        minute: 30
      },
      {
        time: 20,
        minute: 0
      },
      {
        time: 22,
        minute: 5
      },
      {
        time: 23,
        minute: 5
      },
    ]
  }
]

export const vacationTimeTable = [
  {
    "title": "천안 계절 등교/하교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["터미널", "터미널", "08:00"],
      ["성황동 신협", "08:03"],
      ["제일고 맞은편(구 교육청)", "08:06"],
      ["원성동(GS마트)", "08:08"],
      ["삼룡교(유니클로, 구 한방병원)", "08:09"],
      ["구성동 부광약국(구 GS주유소)", "08:10"],
      ["한기대", "08:50"]
    ],
    "timetable2": [
      ["코스", "승차장소", "시간"],
      ["천안역", "천안역", "08:05"],
      ["남부오거리(귀뚜라미보일러)", "08:07"],
      ["삼룡교(유니클로, 구 한방병원)", "08:09"],
      ["구성동 부광약국(구 GS주유소)", "08:10"],
      ["한기대", "08:50"]
    ],
    "rowspan": 7,
    "rowspan2": 5
  },
  {
    "title": "천안 방학 등교/하교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["터미널·천안역", "터미널", "08:00"],
      ["성황동 신협", "08:03"],
      ["천안역", "08:05"],
      ["남부오거리(귀뚜라미보일러)", "08:07"],
      ["삼룡교(유니클로, 구 한방병원)", "08:08"],
      ["구성동 부광약국(구 GS주유소)", "08:10"],
      ["한기대", "08:50"]
    ],
    "rowspan": 7
  },
  {
    "title": "두정동 등교/하교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["두정동", "두정역", "07:43"],
      ["노동부(천안지방사무소)", "07:45"],
      ["늘푸른극동아파트", "07:46"],
      ["성정동지하차도(6단지)", "07:48"],
      ["성정동전자랜드", "07:49"],
      ["광혜당약국", "07:50"],
      ["용암마을", "07:58"],
      ["주공7단지(한라동백BS)", "07:59"],
      ["신방동리차드", "08:03"],
      ["신방동(구 GS주유소)", "08:04"],
      ["청당동(벽산블루밍)", "08:08"],
      ["부영아파트", "08:10"],
      ["동우,신계초,운전리,연춘리", "정차"],
      ["한기대", "08:50"]
    ],
    "rowspan": 14
  },
  {
    "title": "청주 계절(월/금) 등교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["용암동", "용암동 현대아파트", "07:30"],
      ["용암동GS대청주유소", "07:31"],
      ["육거리", "07:33"],
      ["상당공원B(지하상가)", "07:36"],
      ["체육관(NEPA)", "07:40"],
      ["사창사거리", "07:42"],
      ["갤러리호텔(봉명우체국 건너편 BS)", "07:43"],
      ["솔밭공원", "07:45"],
      ["청주역A(서촌동BS)", "07:47"],
      ["옥산(가산3리BS)", "정차"],
      ["한기대", "08:40"]
    ],
    "timetable2": [
      ["코스", "승차장소", "시간"],
      ["체육관", "체육관(NEPA)", "07:40"],
      ["사창사거리", "07:42"],
      ["갤러리호텔(봉명우체국 건너편 BS)", "07:43"],
      ["솔밭공원", "07:45"],
      ["청주역A(서촌동BS)", "07:47"],
      ["옥산(가산3리BS)", "정차"],
      ["한기대", "08:40"]
    ],
    "rowspan": 11,
    "rowspan2": 7
  },
  {
    "title": "청주 계절(월/금) 하교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["용암동", "한기대", "18:10"],
      ["오창과학단지BS", ""],
      ["성모병원 맞은편", "하차"],
      ["문화산업단지(제조창) 맞은편", "하차"],
      ["청주시청(방아다리)", "하차"],
      ["상당공원A", "하차"],
      ["육거리", "하차"],
      ["GS칼텍스(삼양가스)", "하차"],
      ["용암동 현대아파트", "하차"]
    ],
    "timetable2": [
      ["코스", "승차장소", "시간"],
      ["체육관", "한기대", "18:10"],
      ["옥산(가산3리BS)", "하차"],
      ["청주역A 건너편", "하차"],
      ["솔밭공원", "하차"],
      ["갤러리호텔(봉명우체국 BS)", "하차"],
      ["사창사거리", "하차"],
      ["체육관(NEPA)", "하차"],
    ],
    "rowspan": 9,
    "rowspan2": 7
  },
  {
    "title": "청주 방학 등교",
    "timetable": [
      ["코스", "승차장소","시간"],
      ["용암동", "용암동 현대아파트", "07:30"],
      ["용암동GS대청주유소", "07:31"],
      ["육거리", "07:33"],
      ["상당공원B(지하상가)", "07:36"],
      ["체육관(NEPA)", "07:40"],
      ["사창사거리", "07:42"],
      ["갤러리호텔(봉명우체국 건너편 BS)", "07:45"],
      ["솔밭공원", "07:45"],
      ["청주역A(서촌동BS)", "07:47"],
      ["옥산(가산3리BS)", "정차"],
      ["한기대", "08:40"]
    ],
    "rowspan": 11,
  },
  {
    "title": "청주 방학 하교",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["용암동", "한기대", "18:10"],
      ["옥산(가산3리BS)", "하차"],
      ["청주역A(서촌동)", "하차"],
      ["G-Well City", "하차"],
      ["솔밭공원", "하차"],
      ["갤러리호텔(봉명우체국 BS)", "하차"],
      ["사창사거리 부근", "하차"],
      ["체육관(NEPA)", "하차"],
      ["상당공원B(지하상가)", "하차"],
      ["석교동 육거리", "하차"],
      ["GS칼텍스(삼양가스)", "하차"],
      ["용암동 현대아파트", "하차"]
    ],
    "rowspan": 12
  },
  {
    "title": "서울(방학 전체)",
    "timetable": [
      ["코스", "승차장소", "시간"],
      ["등교시", "교대", "07:20"],
      ["동천역 환승정류장", "07:37"],
      ["죽전간이정류장", "07:40"],
      ["한기대", "08:40"],

    ],
    "timetable2": [
      ["코스", "승차장소", "시간"],
      ["하교시", "한기대", "18:10"],
      ["죽전간이정류장", "하차"],
      ["교대", "하차"],
    ],
    "rowspan": 4,
    "rowspan2": 3
  },
  {
    "title": "천안 순환(월~금)",
    "timetable": [
      ["셔틀", "승차장소", "시간"],
      ["터미널·천안역", "한기대", "14:00"],
      ["터미널", "14:25"],
      ["천안역", "14:30"],
      ["삼룡교(유니클로, 구 한방병원)", "14:34"],
      ["구성동 부광약국(구 GS주유소)", "14:35"],
      ["한기대", "15:20"]
    ],
    "rowspan": 6
  }
]
